import { Categories } from "@/types/navLink";

export const categories: Categories[] = [
  {
    title: "الحضارة المصرية",
    description: "مصر جائت ثم جاء التاريخ، مصر قصة حضارة صنعت العالم! في القسم ده، بنربط الماضي بالحاضر وبنكتشف عظمة مصر قديمًا وحديثًا  من خلال التاريخ، الشخصيات العظيمة، العلوم المصرية، الفن الراقي، الأدب العميق، المعمار اللي ملوش مثيل. كل تفصيلة بتأكد إن مصر كانت ومازالت في قلب الحضارة الإنسانية.",
    link: "eg-civilization",
    id: 1,
	SecondaryCategory: [
		{
			title: "التاريخ",
			description: "بنستعرض كل تفصيلة في تاريخ مصر من من عصور ما قبل الأسرات حتى تاريخنا المعاصر.",
			slug: "history",
			id: 1,
		},
		{
			title: "الشخصيات",
			description: "القسم ده رحلة مع الشخصيات المصرية اللي أثرت في التاريخ، من الملوك والقادة لحد المفكرين والعلماء  وكل مصري ساب أثر وبصمة.",
			slug: "influencer",
			id: 2,
		},
		{
			title: "العلوم",
			description: "مصر جائت ثم جاء التاريخ، مصر قصة حضارة صنعت العالم! في القسم ده، بنربط الماضي بالحاضر وبنكتشف عظمة مصر قديمًا وحديثًا  من خلال التاريخ، الشخصيات العظيمة، العلوم المصرية، الفن الراقي، الأدب العميق، المعمار اللي ملوش مثيل. كل تفصيلة بتأكد إن مصر كانت ومازالت في قلب الحضارة الإنسانية.",
			slug: "sciences",
			id: 3,
		},
		{
			title: "الفنون",
			description: "من الجداريات للتماثيل للموسيقى والأدب والمعمار، بنشوف إبداع المصريين عبر العصور وازاي توراثنا الإبداع ده لحد النهارده.",
			slug: "art",
			id: 4,
		},
	]
  },
  {
    title: "الهوية المصرية",
    description: "إحنا مين؟ سؤال مهم، وإجابته بنلاقيها في التاريخ، الثقافة، واللغة. الهوية المصرية مش مجرد موروث، دي حياة بنعيشها كل يوم، بنحافظ عليها ونطورها، في القسم ده هنتكلم عن كل مكونات الهوية المصرية ونوعي كل مصري ومصرية عن هويتهم وذاتهم.",
    link: "eg-identity",
    id: 2,
	SecondaryCategory: [
		{
			title: "المركزية الأفريقية",
			description: "فكر المركزية الأفريقية هو أخطر التحديات اللي بتواجه الهوية المصرية في وطننا مش بس بتشكك في أصول المصريين وأحقيتهم في تاريخهم لا ده فكر بينسب الحضارة المصرية ككل لشعوب تانية زورًا وبهتانًا، دورنا نتصدى للخطر ده عن طريق زيادة الوعي به بشكل كبير",
			slug: "afrocentrism",
			id: 1,
		},
		{
			title: "ثقافة وتراث",
			description: "بنسلط الضوء على العادات، التقاليد، الحرف، والفلكلور المصري اللي بيشكل روح البلد وعلي ضرورة زيادة الوعي بيه وبالحفاظ عليه وتسجيله وحمايته من السرقة والنهب.",
			slug: "culture",
			id: 2,
		},
		{
			title: "اللغة المصرية",
			description: "من الهيروغليفي لحد القبطي ولحد العامية المصرية، بنناقش تطور لغتنا وإزاي نحافظ على هويتنا اللغوية وازاي نزود الوعي باللغة المصرية ونثريها من جديدبنسلط الضوء على العادات، التقاليد، الحرف، والفلكلور المصري اللي بيشكل روح البلد وعلي ضرورة زيادة الوعي بيه وبالحفاظ عليه وتسجيله وحمايته من السرقة والنهب.",
			slug: "eg-language",
			id: 3,
		},
		{
			title: "المجتمع المصري",
			description: "الحفاظ علي وحدة نسيج المجتمع المصري من شيء بيهدد تماسكه ووحدته وده عن طريق التوعية بدور كل مصري ومصرية في الحفاظ علي وحدتهم وتماسكهم سواء أيا كان اصولهم او معتقادتهم الشخصية",
			slug: "eg-society",
			id: 4,
		},
	]
  },
  {
    title: "أخبار وعي",
    description: "هنا بنتابع كل جديد بيخص مصر والعالم، ونسلط الضوء على الأخبار اللي تهم المصريين من منظورنا الفريد.",
    link: "news",
    id: 3,
	SecondaryCategory: [
		{
			title: "رياضة",
			description: "أخبار البطولات، إنجازات الأبطال المصريين في مختلف الرياضات وخصوصًا اللي مبيتمش تسليط الضوء عليها بالشكل الكافي.",
			slug: "sports",
			id: 1,
		},
		{
			title: "فن وثقافة",
			description: "متابعة للأعمال الفنية المصرية والعالمية، وإزاي الفن بيعبر عن هويتنا من السينما والموسيقى إلى المعارض والمسرح.",
			slug: "culture-and-art",
			id: 2,
		},
		{
			title: "عاجل",
			description: "تغطية الأخبار العاجلة والمهمة التي تهم الجمهور المصري.",
			slug: "breaking-news",
			id: 3,
		},
		{
			title: "تصريحات",
			description: "رصد وتحليل التصريحات المهمة للمسؤولين والشخصيات العامة في مختلف المجالات وأبرز التصريحات السياسية، الاقتصادية، والفنية.",
			slug: "statements",
			id: 4,
		},
		{
			title: "منوعات",
			description: "استعراض أخبار متنوعة في الاقتصاد، السياحة، التكنولوجيا، والصحة، مع التركيز على تأثيرها في مصر.",
			slug: "miscellaneous",
			id: 5,
		},
	]
  },
];
